src/result/wrk_sharding.txt
STATUS

Running 10s test @ http://localhost:8080/v0/status
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   172.44us  138.07us   7.78ms   97.36%
    Req/Sec    26.36k     2.55k   32.15k    74.26%
  Latency Distribution
     50%  162.00us
     75%  176.00us
     90%  200.00us
     99%  444.00us
  529640 requests in 10.10s, 53.04MB read
Requests/sec:  52439.01
Transfer/sec:      5.25MB

PUT

Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.208ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.947ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.928ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.135ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.15ms   30.39ms 244.61ms   90.25%
    Req/Sec     1.34k   635.24     6.00k    83.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42ms
 75.000%    2.46ms
 90.000%   40.83ms
 99.000%  151.29ms
 99.900%  223.49ms
 99.990%  240.13ms
 99.999%  244.22ms
100.000%  244.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.105     0.000000            1         1.00
       0.555     0.100000         9987         1.11
       0.828     0.200000        19972         1.25
       1.032     0.300000        29947         1.43
       1.222     0.400000        39958         1.67
       1.422     0.500000        49909         2.00
       1.538     0.550000        54894         2.22
       1.675     0.600000        59899         2.50
       1.836     0.650000        64893         2.86
       2.040     0.700000        69882         3.33
       2.461     0.750000        74864         4.00
       3.243     0.775000        77353         4.44
       5.475     0.800000        79846         5.00
       9.559     0.825000        82341         5.71
      15.495     0.850000        84837         6.67
      25.807     0.875000        87333         8.00
      32.511     0.887500        88580         8.89
      40.831     0.900000        89831        10.00
      49.855     0.912500        91079        11.43
      59.231     0.925000        92322        13.33
      71.999     0.937500        93574        16.00
      78.143     0.943750        94202        17.78
      84.223     0.950000        94826        20.00
      91.775     0.956250        95443        22.86
      98.623     0.962500        96068        26.67
     105.599     0.968750        96692        32.00
     110.079     0.971875        97003        35.56
     114.879     0.975000        97314        40.00
     120.511     0.978125        97628        45.71
     126.783     0.981250        97937        53.33
     133.503     0.984375        98252        64.00
     137.215     0.985938        98407        71.11
     142.463     0.987500        98561        80.00
     148.351     0.989062        98717        91.43
     153.599     0.990625        98874       106.67
     159.231     0.992188        99032       128.00
     161.919     0.992969        99106       142.22
     165.247     0.993750        99188       160.00
     168.959     0.994531        99263       182.86
     175.103     0.995313        99341       213.33
     181.503     0.996094        99418       256.00
     186.367     0.996484        99457       284.44
     189.951     0.996875        99496       320.00
     193.279     0.997266        99535       365.71
     197.503     0.997656        99574       426.67
     202.623     0.998047        99613       512.00
     206.207     0.998242        99632       568.89
     209.407     0.998437        99652       640.00
     213.759     0.998633        99671       731.43
     219.519     0.998828        99692       853.33
     223.871     0.999023        99711      1024.00
     224.639     0.999121        99724      1137.78
     225.279     0.999219        99732      1280.00
     225.919     0.999316        99739      1462.86
     227.071     0.999414        99749      1706.67
     228.351     0.999512        99759      2048.00
     229.119     0.999561        99764      2275.56
     230.271     0.999609        99769      2560.00
     230.783     0.999658        99773      2925.71
     231.551     0.999707        99778      3413.33
     232.703     0.999756        99783      4096.00
     234.495     0.999780        99786      4551.11
     235.775     0.999805        99788      5120.00
     237.055     0.999829        99790      5851.43
     237.823     0.999854        99793      6826.67
     238.975     0.999878        99795      8192.00
     240.127     0.999890        99797      9102.22
     240.511     0.999902        99798     10240.00
     241.151     0.999915        99799     11702.86
     241.663     0.999927        99800     13653.33
     242.303     0.999939        99801     16384.00
     242.943     0.999945        99802     18204.44
     243.455     0.999951        99804     20480.00
     243.455     0.999957        99804     23405.71
     243.455     0.999963        99804     27306.67
     243.455     0.999969        99804     32768.00
     243.839     0.999973        99805     36408.89
     243.839     0.999976        99805     40960.00
     243.839     0.999979        99805     46811.43
     244.223     0.999982        99806     54613.33
     244.223     0.999985        99806     65536.00
     244.223     0.999986        99806     72817.78
     244.223     0.999988        99806     81920.00
     244.223     0.999989        99806     93622.86
     244.735     0.999991        99807    109226.67
     244.735     1.000000        99807          inf
#[Mean    =       12.154, StdDeviation   =       30.386]
#[Max     =      244.608, Total count    =        99807]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149828 requests in 30.00s, 9.57MB read
Requests/sec:   4993.68
Transfer/sec:    326.74KB


GET

Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.252ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.246ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms  572.88us   8.09ms   65.63%
    Req/Sec     1.32k   121.43     2.11k    67.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.64ms
 90.000%    2.03ms
 99.000%    2.51ms
 99.900%    3.11ms
 99.990%    7.07ms
 99.999%    7.93ms
100.000%    8.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.104     0.000000            1         1.00
       0.493     0.100000        10005         1.11
       0.745     0.200000        20013         1.25
       0.918     0.300000        30025         1.43
       1.070     0.400000        40039         1.67
       1.216     0.500000        49996         2.00
       1.289     0.550000        55010         2.22
       1.364     0.600000        60028         2.50
       1.447     0.650000        64993         2.86
       1.539     0.700000        70012         3.33
       1.643     0.750000        74973         4.00
       1.701     0.775000        77481         4.44
       1.761     0.800000        79994         5.00
       1.822     0.825000        82473         5.71
       1.891     0.850000        84974         6.67
       1.959     0.875000        87496         8.00
       1.994     0.887500        88720         8.89
       2.033     0.900000        89986        10.00
       2.077     0.912500        91253        11.43
       2.121     0.925000        92477        13.33
       2.169     0.937500        93749        16.00
       2.193     0.943750        94350        17.78
       2.221     0.950000        94989        20.00
       2.251     0.956250        95598        22.86
       2.285     0.962500        96226        26.67
       2.323     0.968750        96847        32.00
       2.341     0.971875        97160        35.56
       2.365     0.975000        97490        40.00
       2.387     0.978125        97781        45.71
       2.413     0.981250        98103        53.33
       2.441     0.984375        98401        64.00
       2.461     0.985938        98566        71.11
       2.477     0.987500        98716        80.00
       2.499     0.989062        98871        91.43
       2.521     0.990625        99028       106.67
       2.543     0.992188        99186       128.00
       2.557     0.992969        99263       142.22
       2.575     0.993750        99345       160.00
       2.597     0.994531        99416       182.86
       2.617     0.995313        99495       213.33
       2.645     0.996094        99577       256.00
       2.661     0.996484        99611       284.44
       2.683     0.996875        99651       320.00
       2.709     0.997266        99689       365.71
       2.737     0.997656        99728       426.67
       2.765     0.998047        99770       512.00
       2.785     0.998242        99789       568.89
       2.815     0.998437        99806       640.00
       2.855     0.998633        99826       731.43
       2.929     0.998828        99847       853.33
       3.139     0.999023        99865      1024.00
       3.313     0.999121        99875      1137.78
       3.461     0.999219        99884      1280.00
       3.683     0.999316        99894      1462.86
       4.015     0.999414        99904      1706.67
       4.427     0.999512        99914      2048.00
       4.783     0.999561        99919      2275.56
       5.171     0.999609        99923      2560.00
       5.495     0.999658        99928      2925.71
       5.739     0.999707        99933      3413.33
       5.999     0.999756        99938      4096.00
       6.075     0.999780        99941      4551.11
       6.107     0.999805        99943      5120.00
       6.191     0.999829        99945      5851.43
       6.463     0.999854        99948      6826.67
       6.687     0.999878        99950      8192.00
       7.071     0.999890        99952      9102.22
       7.103     0.999902        99953     10240.00
       7.107     0.999915        99954     11702.86
       7.223     0.999927        99955     13653.33
       7.463     0.999939        99956     16384.00
       7.531     0.999945        99957     18204.44
       7.731     0.999951        99958     20480.00
       7.731     0.999957        99958     23405.71
       7.735     0.999963        99959     27306.67
       7.735     0.999969        99959     32768.00
       7.791     0.999973        99960     36408.89
       7.791     0.999976        99960     40960.00
       7.791     0.999979        99960     46811.43
       7.927     0.999982        99961     54613.33
       7.927     0.999985        99961     65536.00
       7.927     0.999986        99961     72817.78
       7.927     0.999988        99961     81920.00
       7.927     0.999989        99961     93622.86
       8.095     0.999991        99962    109226.67
       8.095     1.000000        99962          inf
#[Mean    =        1.250, StdDeviation   =        0.573]
#[Max     =        8.092, Total count    =        99962]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149987 requests in 30.00s, 9.87MB read
  Non-2xx or 3xx responses: 149987
Requests/sec:   4999.85
Transfer/sec:    336.90KB

Из результатов, сравнивая с предыдущей версией (async), результаты нагрузочного тестирования по всем видам запросов (GET, PUT, STATUS) ухудшились, в связи с тем, что в данной реализации (с шардированием) некоторое время уходит на проксирование между node-ами. Тоже самое мы наблюдаем на результатах с async-profiler-а. Результаты профилирования шардированной версии: (get/put/status)_sharding.svg